Autodesk.Revit.DB.SpecTypeId.WireDiameter
Wire Diameter, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.WeightPerUnitLength
Weight per Unit Length, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Weight
Weight, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Wattage
Wattage, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.WarpingConstant
Warping Constant, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Volume
Volume, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.UnitWeight
Unit Weight, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Time
Time, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ThermalResistance
Thermal Resistance, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ThermalMass
Thermal Mass, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ThermalGradientCoefficientForMoistureCapacity
Thermal Gradient Coefficient for Moisture Capacity, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ThermalExpansionCoefficient
Thermal Expansion Coefficient, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ThermalConductivity
Thermal Conductivity, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.SurfaceAreaPerUnitLength
Surface Area per Unit Length, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.StructuralVelocity
Velocity, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.StructuralFrequency
Frequency, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Stress
Stress, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.StationingInterval
Stationing Interval, in discipline Infrastructure.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Stationing
Stationing, in discipline Infrastructure.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Speed
Speed, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.SpecificHeatOfVaporization
Specific Heat of Vaporization, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.SpecificHeat
Specific Heat, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Slope
Slope, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.SiteAngle
Site Angle, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.SheetLength
Sheet Length, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.SectionProperty
Section Property, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.SectionModulus
Section Modulus, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.SectionDimension
Section Dimension, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.SectionArea
Section Area, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.RotationalPointSpringCoefficient
Rotational Point Spring Coefficient, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.RotationalLineSpringCoefficient
Rotational Line Spring Coefficient, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.RotationAngle
Rotation Angle, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Rotation
Rotation, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ReinforcementVolume
Reinforcement Volume, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ReinforcementSpacing
Reinforcement Spacing, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ReinforcementLength
Reinforcement Length, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ReinforcementCover
Reinforcement Cover, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ReinforcementAreaPerUnitLength
Reinforcement Area per Unit Length, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ReinforcementArea
Reinforcement Area, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Pulsation
Pulsation, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PowerPerLength
Power per Length, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PowerPerFlow
Power per Flow, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PointSpringCoefficient
Point Spring Coefficient, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingVolume
Volume, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingViscosity
Dynamic Viscosity, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingVelocity
Velocity, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingTemperatureDifference
Temperature Difference, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingTemperature
Temperature, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingSlope
Slope, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingRoughness
Roughness, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingPressure
Pressure, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingMassPerTime
Mass per Time, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingMass
Mass, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingFriction
Friction, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipingDensity
Density, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipeSize
Pipe Size, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipeMassPerUnitLength
Mass per Unit Length, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipeInsulationThickness
Pipe Insulation Thickness, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.PipeDimension
Pipe Dimension, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Permeability
Permeability, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Period
Period, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Number
Number, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.MomentScale
Moment Scale, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.MomentOfInertia
Moment of Inertia, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Moment
Moment, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.MassPerUnitLength
Mass per Unit Length, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.MassPerUnitArea
Mass per Unit Area, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.MassDensity
Mass Density, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Mass
Mass, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.LuminousIntensity
Luminous Intensity, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.LuminousFlux
Luminous Flux, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Luminance
Luminance, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.LinearMomentScale
Linear Moment Scale, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.LinearMoment
Linear Moment, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.LinearForceScale
Linear Force Scale, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.LinearForce
Linear Force, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.LineSpringCoefficient
Line Spring Coefficient, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Length
Length, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.IsothermalMoistureCapacity
Isothermal Moisture Capacity, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Illuminance
Illuminance, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacViscosity
Dynamic Viscosity, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacVelocity
Velocity, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacTemperatureDifference
Temperature Difference, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacTemperature
Temperature, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacSlope
Slope, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacRoughness
Roughness, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacPressure
Pressure, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacPowerDensity
Power Density, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacPower
Power, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacMassPerTime
Mass per Time, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacFriction
Friction, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacEnergy
Energy, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HvacDensity
Density, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HeatingLoadDividedByVolume
Heating Load divided by Volume, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HeatingLoadDividedByArea
Heating Load divided by Area, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HeatingLoad
Heating Load, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HeatTransferCoefficient
Coefficient of Heat Transfer, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HeatGain
Heat Gain, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.HeatCapacityPerArea
Heat Capacity per Area, in discipline Energy.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ForceScale
Force Scale, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Force
Force, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.FlowPerPower
Flow per Power, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Flow
Flow, in discipline Piping.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Factor
Factor, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Energy
Energy, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ElectricalTemperatureDifference
Temperature Difference, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ElectricalTemperature
Temperature, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ElectricalResistivity
Electrical Resistivity, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ElectricalPowerDensity
Power Density, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ElectricalPower
Power, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ElectricalPotential
Electrical Potential, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ElectricalFrequency
Frequency, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Efficacy
Efficacy, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.DuctSize
Duct Size, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.DuctLiningThickness
Duct Lining Thickness, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.DuctInsulationThickness
Duct Insulation Thickness, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Distance
Distance, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Displacement
Displacement/Deflection, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Diffusivity
Diffusivity, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.DemandFactor
Demand Factor, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.DecimalSheetLength
Decimal Sheet Length, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Current
Current, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Currency
Currency, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.CrossSection
Cross Section, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.CrackWidth
Crack Width, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.CostRatePower
Cost Rate Power, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.CostRateEnergy
Cost Rate Energy, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.CostPerArea
Cost per Area, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.CoolingLoadDividedByVolume
Cooling Load divided by Volume, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.CoolingLoadDividedByArea
Cooling Load divided by Area, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.CoolingLoad
Cooling Load, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ConduitSize
Conduit Size, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ColorTemperature
Color Temperature, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.CableTraySize
Cable Tray Size, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.BarDiameter
Bar Diameter, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.AreaSpringCoefficient
Area Spring Coefficient, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.AreaForceScale
Area Force Scale, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.AreaForce
Area Force, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.AreaDividedByHeatingLoad
Area divided by Heating Load, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.AreaDividedByCoolingLoad
Area divided by Cooling Load, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Area
Area, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ApparentPowerDensity
Apparent Power Density, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.ApparentPower
Apparent Power, in discipline Electrical.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.AngularSpeed
Angular Speed, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Angle
Angle, in discipline Common.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.AirFlowDividedByVolume
Air Flow divided by Volume, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.AirFlowDividedByCoolingLoad
Air Flow divided by Cooling Load, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.AirFlowDensity
Air Flow Density, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.AirFlow
Air Flow, in discipline HVAC.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Acceleration
Acceleration, in discipline Structural.
Since:
2021

Autodesk.Revit.DB.SpecTypeId.Custom
Unrecognized custom spec.
Since:
2021

Autodesk.Revit.DB.SpecTypeId
This class contains constants identifying specs.
Since:
2021